# GetRoofPreferences

## Description
Gets the Roof Preferences. This can be used with the component calls and the Style selectors.

```pascal
FUNCTION GetRoofPreferences : HANDLE;
```

```python
def vs.GetRoofPreferences():
    return HANDLE
```

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural